#+title: introduction-to-dotnet
#+LATEX_CLASS: article
#+LATEX_CLASS_PAPER: [a4paper]
#+OPTIONS: toc:nil num:nil

* C#
C# (Pronounced as _see sharp_ ) is a part of a family of languages that evoled from the C/C++ languages, originating back in the 1960's.

C# is both compiled and strongly-typed language. In a compiled language, the human-readable code is transform, or compiled, into code that computers can read much more efficiently, which makes it faster. A strongly-typed language means that every piece of data and every variable must be of a particular type. Not only that , we must explicitly list the type next to every variable we create.
transformed

#+begin_src csharp :exports both
using System;

class Program
{
    static void Main()
        {
            Console.WriteLine("Hello from Org Mode!");
        }
}
#+end_src

#+RESULTS:
: Hello from Org Mode!

